In [0]:
import pandas as pd

two types

*   Series  " we can give customized index" giving index is not mandatory if we didnt give index it will common index
*   Dartaframe

In [128]:
s = pd.Series([1,2,3],'a b c'.split())
s

a    1
b    2
c    3
dtype: int64

In [129]:
d = {'f':4,'b':2,'g':3}
s1 = pd.Series(d)
s1

f    4
b    2
g    3
dtype: int64

In [130]:
s1['f']

4

In [131]:
# use iloc method "even though we have customized index we can access default index using iloc method"
s.iloc[2]

3

In [132]:
s+s1
# it will perform the operation for which having matched indexed keys

a    NaN
b    4.0
c    NaN
f    NaN
g    NaN
dtype: float64

In [0]:
# data frame is kind of multiple series
# series kind of vectors
# dataframes also having column names

In [0]:
# array, index , columns
import numpy as np
df = pd.DataFrame(np.random.randn(5,4), 'a b c d e'.split(), 'w x y z'.split())
#pd.DataFrame(np.random.randn(5,4),  columns='w x y z'.split())

In [135]:
df['w']
# selecting columns

a   -2.343042
b    1.007139
c   -0.414113
d    0.620665
e    0.664782
Name: w, dtype: float64

In [136]:
# fany indexing giving selectes columns as list
df[['x','z']]

          x         z
a  1.431347  0.143790
b -0.449697 -2.717228
c -1.429846  0.363698
d  0.875883 -0.261040
e -0.690733  0.944126

In [0]:
df['new'] = np.arange(0,5)
# giving new column and values but you should give same size of elements (lenght should be match)

In [138]:
df

          w         x         y         z  new
a -2.343042  1.431347  1.346701  0.143790    0
b  1.007139 -0.449697 -0.808971 -2.717228    1
c -0.414113 -1.429846  0.320055  0.363698    2
d  0.620665  0.875883  0.284288 -0.261040    3
e  0.664782 -0.690733  0.459435  0.944126    4

In [139]:
df.drop('new',axis =1)
# drop to remove
# axis = 0 mean rows, axis = 1 mean column

          w         x         y         z
a -2.343042  1.431347  1.346701  0.143790
b  1.007139 -0.449697 -0.808971 -2.717228
c -0.414113 -1.429846  0.320055  0.363698
d  0.620665  0.875883  0.284288 -0.261040
e  0.664782 -0.690733  0.459435  0.944126

In [140]:
df

          w         x         y         z  new
a -2.343042  1.431347  1.346701  0.143790    0
b  1.007139 -0.449697 -0.808971 -2.717228    1
c -0.414113 -1.429846  0.320055  0.363698    2
d  0.620665  0.875883  0.284288 -0.261040    3
e  0.664782 -0.690733  0.459435  0.944126    4

In [0]:
# its not removed to remove use inplace = true

In [142]:
df.drop('new',axis =1,inplace= True)
df

          w         x         y         z
a -2.343042  1.431347  1.346701  0.143790
b  1.007139 -0.449697 -0.808971 -2.717228
c -0.414113 -1.429846  0.320055  0.363698
d  0.620665  0.875883  0.284288 -0.261040
e  0.664782 -0.690733  0.459435  0.944126

In [143]:
# while dropping rows no need to give axis because its default set to rows axis =0
df.drop('e')

          w         x         y         z
a -2.343042  1.431347  1.346701  0.143790
b  1.007139 -0.449697 -0.808971 -2.717228
c -0.414113 -1.429846  0.320055  0.363698
d  0.620665  0.875883  0.284288 -0.261040

In [144]:
# for indexing rows ( acceass)
df.loc['c']

w   -0.414113
x   -1.429846
y    0.320055
z    0.363698
Name: c, dtype: float64

In [145]:
df['y']['b']

-0.8089711339590383

In [146]:
df.loc['b']['y']

-0.8089711339590383

In [147]:
df.loc['b','y']

-0.8089711339590383

In [148]:
df.iloc[1,2]
# iloc us used to access default indees

-0.8089711339590383

In [149]:
df.iloc[1:4,2:4]

          y         z
b -0.808971 -2.717228
c  0.320055  0.363698
d  0.284288 -0.261040

In [150]:
df.loc[['d','a','c'],['y','z','w']]
#giving list of rows and columns fancy indexing

          y         z         w
d  0.284288 -0.261040  0.620665
a  1.346701  0.143790 -2.343042
c  0.320055  0.363698 -0.414113

In [151]:
pd.__version__

'1.0.3'

In [152]:
df>0

       w      x      y      z
a  False   True   True   True
b   True  False  False  False
c  False  False   True   True
d   True   True   True  False
e   True  False   True   True

In [153]:
df[df>0]

          w         x         y         z
a       NaN  1.431347  1.346701  0.143790
b  1.007139       NaN       NaN       NaN
c       NaN       NaN  0.320055  0.363698
d  0.620665  0.875883  0.284288       NaN
e  0.664782       NaN  0.459435  0.944126

In [154]:
#apply condition on only column
df[df['x']>0]

          w         x         y        z
a -2.343042  1.431347  1.346701  0.14379
d  0.620665  0.875883  0.284288 -0.26104

In [155]:

df[df['x']>0]['y']
# sal[sal['age']]['salr'].mean()
# find the average of salry above 50 age

a    1.346701
d    0.284288
Name: y, dtype: float64

In [156]:
df[(df['x']>0) & (df['w']>0)]
# all the condition should be enclosed in ()
# multiple condition

          w         x         y        z
d  0.620665  0.875883  0.284288 -0.26104

In [157]:
df

          w         x         y         z
a -2.343042  1.431347  1.346701  0.143790
b  1.007139 -0.449697 -0.808971 -2.717228
c -0.414113 -1.429846  0.320055  0.363698
d  0.620665  0.875883  0.284288 -0.261040
e  0.664782 -0.690733  0.459435  0.944126

In [158]:
df.reset_index()

  index         w         x         y         z
0     a -2.343042  1.431347  1.346701  0.143790
1     b  1.007139 -0.449697 -0.808971 -2.717228
2     c -0.414113 -1.429846  0.320055  0.363698
3     d  0.620665  0.875883  0.284288 -0.261040
4     e  0.664782 -0.690733  0.459435  0.944126

In [159]:
df

          w         x         y         z
a -2.343042  1.431347  1.346701  0.143790
b  1.007139 -0.449697 -0.808971 -2.717228
c -0.414113 -1.429846  0.320055  0.363698
d  0.620665  0.875883  0.284288 -0.261040
e  0.664782 -0.690733  0.459435  0.944126

In [0]:
df.reset_index(inplace =True)

In [161]:
df

  index         w         x         y         z
0     a -2.343042  1.431347  1.346701  0.143790
1     b  1.007139 -0.449697 -0.808971 -2.717228
2     c -0.414113 -1.429846  0.320055  0.363698
3     d  0.620665  0.875883  0.284288 -0.261040
4     e  0.664782 -0.690733  0.459435  0.944126

In [162]:
df.set_index('index',inplace= True)
df

              w         x         y         z
index
a     -2.343042  1.431347  1.346701  0.143790
b      1.007139 -0.449697 -0.808971 -2.717228
c     -0.414113 -1.429846  0.320055  0.363698
d      0.620665  0.875883  0.284288 -0.261040
e      0.664782 -0.690733  0.459435  0.944126

In [163]:
df.index
# to get the names of indices

Index(['a', 'b', 'c', 'd', 'e'], dtype='object', name='index')

In [164]:
df.columns
# get colummns

Index(['w', 'x', 'y', 'z'], dtype='object')

In [165]:
l1 = ['a','a','a','b','b','b']
l2 = [1,2,3,1,2,3]
index = list(zip(l1,l2))
index

[('a', 1), ('a', 2), ('a', 3), ('b', 1), ('b', 2), ('b', 3)]

In [0]:
index = pd.MultiIndex.from_tuples(index)

In [167]:
mdf = pd.DataFrame(np.random.rand(6,3),index = index,columns=['x','y','z'])
# this multi layer rows
mdf

            x         y         z
a 1  0.408405  0.817325  0.074815
  2  0.857726  0.063382  0.460259
  3  0.699262  0.879490  0.830844
b 1  0.393079  0.194097  0.636294
  2  0.459212  0.539430  0.299142
  3  0.055282  0.394669  0.564001

In [168]:
df.loc['a']

w   -2.343042
x    1.431347
y    1.346701
z    0.143790
Name: a, dtype: float64

In [169]:
df.loc['a'].iloc[1]

1.4313474646482145

In [0]:
import numpy as np
import pandas as pd
d1 = pd.DataFrame(np.random.rand(3,3),[1,2,3],'a b b'.split())
d2 = pd.DataFrame(np.random.rand(3,3),[4,5,6],'a b b'.split())
d3 = pd.DataFrame(np.random.rand(3,3),[7,8,9],'a b b'.split())

In [171]:
d1

          a         b         b
1  0.331939  0.942001  0.429228
2  0.869771  0.631171  0.660907
3  0.629294  0.136263  0.272071

In [172]:
d2

          a         b         b
4  0.585322  0.044166  0.211097
5  0.388579  0.202632  0.947303
6  0.886787  0.416436  0.899392

In [173]:
d3

          a         b         b
7  0.695842  0.129100  0.297620
8  0.724173  0.076380  0.152470
9  0.305266  0.512242  0.828156

In [174]:
pd.concat([d1,d2,d3])
# concat join data frame together
# columns have to be same then it will concatenate

          a         b         b
1  0.331939  0.942001  0.429228
2  0.869771  0.631171  0.660907
3  0.629294  0.136263  0.272071
4  0.585322  0.044166  0.211097
5  0.388579  0.202632  0.947303
6  0.886787  0.416436  0.899392
7  0.695842  0.129100  0.297620
8  0.724173  0.076380  0.152470
9  0.305266  0.512242  0.828156

In [175]:
pd.concat([d1,d2,d3],axis = 1)

          a         b         b  ...         a         b         b
1  0.331939  0.942001  0.429228  ...       NaN       NaN       NaN
2  0.869771  0.631171  0.660907  ...       NaN       NaN       NaN
3  0.629294  0.136263  0.272071  ...       NaN       NaN       NaN
4       NaN       NaN       NaN  ...       NaN       NaN       NaN
5       NaN       NaN       NaN  ...       NaN       NaN       NaN
6       NaN       NaN       NaN  ...       NaN       NaN       NaN
7       NaN       NaN       NaN  ...  0.695842  0.129100  0.297620
8       NaN       NaN       NaN  ...  0.724173  0.076380  0.152470
9       NaN       NaN       NaN  ...  0.305266  0.512242  0.828156

[9 rows x 9 columns]

In [176]:
l1 = [1,2,3,4,5,6,7,8,9]
l2 = 'a b c d e f g h i'.split()
movie_names = list(zip(l1,l2))
movie_names

[(1, 'a'),
 (2, 'b'),
 (3, 'c'),
 (4, 'd'),
 (5, 'e'),
 (6, 'f'),
 (7, 'g'),
 (8, 'h'),
 (9, 'i')]

In [177]:
l3 = [4,5,6,7,8,9,5]
l4 = [4,3,4,5,6,7,1]
movie_ratings = list(zip(l3,l4))
movie_ratings

[(4, 4), (5, 3), (6, 4), (7, 5), (8, 6), (9, 7), (5, 1)]

In [0]:
names = pd.DataFrame(movie_names,columns=['id','name'])
ratings = pd.DataFrame(movie_ratings,columns=['id','rating'])

In [179]:
names

   id name
0   1    a
1   2    b
2   3    c
3   4    d
4   5    e
5   6    f
6   7    g
7   8    h
8   9    i

In [180]:
ratings

   id  rating
0   4       4
1   5       3
2   6       4
3   7       5
4   8       6
5   9       7
6   5       1

In [181]:
# we can join two dataframes together 
# id is the column which compares 
# merge is nothing but like sql joins
pd.merge(names,ratings,on='id',how='inner')

   id name  rating
0   4    d       4
1   5    e       3
2   5    e       1
3   6    f       4
4   7    g       5
5   8    h       6
6   9    i       7

In [182]:
pd.merge(names,ratings,on='id',how='outer')
# it will show all whether it id match or not

   id name  rating
0   1    a     NaN
1   2    b     NaN
2   3    c     NaN
3   4    d     4.0
4   5    e     3.0
5   5    e     1.0
6   6    f     4.0
7   7    g     5.0
8   8    h     6.0
9   9    i     7.0

In [183]:
pd.merge(names,ratings,on='id',how='left')
# left side values doesnt have null values

   id name  rating
0   1    a     NaN
1   2    b     NaN
2   3    c     NaN
3   4    d     4.0
4   5    e     3.0
5   5    e     1.0
6   6    f     4.0
7   7    g     5.0
8   8    h     6.0
9   9    i     7.0

In [184]:
pd.merge(names,ratings,on='id',how='right')
# right side values doesnt have null values
# right side mean data frame right side df

   id name  rating
0   4    d       4
1   5    e       3
2   5    e       1
3   6    f       4
4   7    g       5
5   8    h       6
6   9    i       7

In [0]:
d1 = pd.DataFrame(np.random.rand(3,2),[1,2,3],['a','b'])
d2 = pd.DataFrame(np.random.rand(3,2),[2,3,4],['c','d'])

In [186]:
d1

          a         b
1  0.492219  0.543946
2  0.512035  0.368659
3  0.350384  0.081126

In [187]:
d2

          c         d
2  0.055594  0.218930
3  0.755113  0.344214
4  0.144106  0.055409

In [188]:
# jon method join two DFS side by side
d1.join(d2)

          a         b         c         d
1  0.492219  0.543946       NaN       NaN
2  0.512035  0.368659  0.055594  0.218930
3  0.350384  0.081126  0.755113  0.344214

In [189]:
# jon method join two DFS side by side
d1.join(d2, how='outer')
#default how is set to left

          a         b         c         d
1  0.492219  0.543946       NaN       NaN
2  0.512035  0.368659  0.055594  0.218930
3  0.350384  0.081126  0.755113  0.344214
4       NaN       NaN  0.144106  0.055409

In [190]:
d = {'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','egf','hgi','xys']}
df = pd.DataFrame(d)
df

   col1  col2 col3
0     1   444  abc
1     2   555  egf
2     3   666  hgi
3     4   444  xys

In [191]:
# common operation perform with df
df.info()
# rows, columns, data types, ram its using

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [192]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [193]:
df.head()
# first 5 rows it will return

   col1  col2 col3
0     1   444  abc
1     2   555  egf
2     3   666  hgi
3     4   444  xys

In [194]:
df.tail()
# it wil retuen last 5 rows

   col1  col2 col3
0     1   444  abc
1     2   555  egf
2     3   666  hgi
3     4   444  xys

In [195]:
df['col2'].unique()

array([444, 555, 666])

In [196]:
len(df['col2'].unique())
# count of unique values

3

In [197]:
df['col2'].nunique()
# count of unique values

3

In [198]:
df['col2'].value_counts()
#how many times that value is repeated

444    2
555    1
666    1
Name: col2, dtype: int64

In [199]:
df['col2'].mean()

527.25

In [200]:
df.sort_values('col2')
# sort columns by col2

   col1  col2 col3
0     1   444  abc
3     4   444  xys
1     2   555  egf
2     3   666  hgi

In [201]:
df.sort_values(['col2','col1'])

   col1  col2 col3
0     1   444  abc
3     4   444  xys
1     2   555  egf
2     3   666  hgi

In [202]:
df.sort_values('col2',ascending=False)
#defualt ascending is true)

   col1  col2 col3
2     3   666  hgi
1     2   555  egf
0     1   444  abc
3     4   444  xys

In [203]:
# apply fucntion on each and every element of column
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [204]:
df['col1'].apply(lambda a:a**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [205]:
# pivot tables
d = {'a':[1,2,3,4,5,6],'b':'x y x y x y'.split(),'c':'a b c a b c'.split()}
df  = pd.DataFrame(d)
df

   a  b  c
0  1  x  a
1  2  y  b
2  3  x  c
3  4  y  a
4  5  x  b
5  6  y  c

In [206]:
df.pivot_table(values='a',index='b',columns='c')
# rearranging entire data set

c  a  b  c
b
x  1  5  3
y  4  2  6

In [0]:
import seaborn as sns
df = sns.load_dataset('flights')